README.org
#+TITLE: pk_stl README
#+AUTHOR: Mateo Carreras

* Introduction

pk_stl is a Rust library for reading and writing STL files, and has no additional
dependencies other than the standard library. It can read and write both ASCII
and binary STL files.

** STL File Support

There are two main STL file formats: binary and ascii.

|       | Binary | ASCII |
|-------+--------+-------|
| Read  | Yes    | Yes   |
| Write | Yes    | Yes   |

Additionally, this library does not suppport any additional attributes attached
to the triangles or model, but this features will be in a future release. If
metadata from the header is needed, this library does provide access to the
contents of the header.

* Documentation

For full documentaiton run:

#+BEGIN_SRC bash
  cargo doc --open
#+END_SRC

Or visit [[https://docs.rs/pk_stl/latest/pk_stl]]

